In [1]:
# Import the libraries
import pandas as pd
import numpy as np

In [2]:
# Creating a dataset
data=pd.DataFrame({'Fruits':['Apple','Banana','Mango','Orange','Kiwi','Pomegranate'],
                   'Quantity':[10,35,20,46,67,23],
                    'Price':[76.,30.5,100.34,56.,150.50,90.]},index=[1,2,3,4,5,6],columns=['Fruits','Quantity','Price'])
data

        Fruits  Quantity   Price
1        Apple        10   76.00
2       Banana        35   30.50
3        Mango        20  100.34
4       Orange        46   56.00
5         Kiwi        67  150.50
6  Pomegranate        23   90.00

## head():-

In [3]:
# To watch some of the top rows use head() method
data.head()

   Fruits  Quantity   Price
1   Apple        10   76.00
2  Banana        35   30.50
3   Mango        20  100.34
4  Orange        46   56.00
5    Kiwi        67  150.50

In [4]:
# You can also provide the number of rows to be displayed
data.head(3)

   Fruits  Quantity   Price
1   Apple        10   76.00
2  Banana        35   30.50
3   Mango        20  100.34

## tail():-

In [5]:
# To watch some of the bottom rows use tail() method
data.tail()

        Fruits  Quantity   Price
2       Banana        35   30.50
3        Mango        20  100.34
4       Orange        46   56.00
5         Kiwi        67  150.50
6  Pomegranate        23   90.00

In [6]:
# You can also provide number of rows to be displayed
data.tail(2)

        Fruits  Quantity  Price
5         Kiwi        67  150.5
6  Pomegranate        23   90.0

## index and columns attribute:-

In [7]:
# To get the index of dataframe
data.index

Int64Index([1, 2, 3, 4, 5, 6], dtype='int64')

In [8]:
# To get the names of columns
data.columns

Index(['Fruits', 'Quantity', 'Price'], dtype='object')

## to_numpy():-

In [9]:
# To get the dataframe in form of array
data.to_numpy()

array([['Apple', 10, 76.0],
       ['Banana', 35, 30.5],
       ['Mango', 20, 100.34],
       ['Orange', 46, 56.0],
       ['Kiwi', 67, 150.5],
       ['Pomegranate', 23, 90.0]], dtype=object)

## describe():-

In [10]:
# describe() method is used to display quick statistic summary of your data
data.describe()

        Quantity       Price
count   6.000000    6.000000
mean   33.500000   83.890000
std    20.617953   41.074135
min    10.000000   30.500000
25%    20.750000   61.000000
50%    29.000000   83.000000
75%    43.250000   97.755000
max    67.000000  150.500000

## T(Transposing) attribute:-

In [11]:
# To transpose the data table
data.T

              1       2       3       4      5            6
Fruits    Apple  Banana   Mango  Orange   Kiwi  Pomegranate
Quantity     10      35      20      46     67           23
Price        76    30.5  100.34      56  150.5           90

## Sorting:-

In [12]:
# To sort according to index
data.sort_index(axis=1, ascending=False)

   Quantity   Price       Fruits
1        10   76.00        Apple
2        35   30.50       Banana
3        20  100.34        Mango
4        46   56.00       Orange
5        67  150.50         Kiwi
6        23   90.00  Pomegranate

In [13]:
# To sort according to values
data.sort_values(by='Quantity')

        Fruits  Quantity   Price
1        Apple        10   76.00
3        Mango        20  100.34
6  Pomegranate        23   90.00
2       Banana        35   30.50
4       Orange        46   56.00
5         Kiwi        67  150.50

## Selection:-

In [14]:
# To select the column
data['Fruits']

1          Apple
2         Banana
3          Mango
4         Orange
5           Kiwi
6    Pomegranate
Name: Fruits, dtype: object

In [15]:
# To select the rows i.e. slicing
data[0:4]

   Fruits  Quantity   Price
1   Apple        10   76.00
2  Banana        35   30.50
3   Mango        20  100.34
4  Orange        46   56.00

## loc[]:-

In [16]:
# loc[index,columns]
# To select row or number of rows by index or label
data.loc[1]

Fruits      Apple
Quantity       10
Price          76
Name: 1, dtype: object

In [17]:
# To select some data from table
data.loc[:,('Fruits','Price')]

        Fruits   Price
1        Apple   76.00
2       Banana   30.50
3        Mango  100.34
4       Orange   56.00
5         Kiwi  150.50
6  Pomegranate   90.00

In [18]:
data.loc[2:5,['Fruits','Price']]

   Fruits   Price
2  Banana   30.50
3   Mango  100.34
4  Orange   56.00
5    Kiwi  150.50

In [19]:
# at[] to access single value at the given row and column
data.at[2,'Fruits']

'Banana'

## iloc[]:-

In [20]:
# iloc[position of rows,position of columns]
# To select rows and columns
data.iloc[:,0]

1          Apple
2         Banana
3          Mango
4         Orange
5           Kiwi
6    Pomegranate
Name: Fruits, dtype: object

In [21]:
data.iloc[1:3,:]

   Fruits  Quantity   Price
2  Banana        35   30.50
3   Mango        20  100.34

In [22]:
data.iloc[:,:]

        Fruits  Quantity   Price
1        Apple        10   76.00
2       Banana        35   30.50
3        Mango        20  100.34
4       Orange        46   56.00
5         Kiwi        67  150.50
6  Pomegranate        23   90.00

In [23]:
data.iloc[0:,0:2]

        Fruits  Quantity
1        Apple        10
2       Banana        35
3        Mango        20
4       Orange        46
5         Kiwi        67
6  Pomegranate        23

In [24]:
# iat[] is used to access scalar value by providing its position just like in an array
data.iat[2,2]

100.34

## copy():-

In [25]:
# To copy a dataset
data1=data.copy()
data1

        Fruits  Quantity   Price
1        Apple        10   76.00
2       Banana        35   30.50
3        Mango        20  100.34
4       Orange        46   56.00
5         Kiwi        67  150.50
6  Pomegranate        23   90.00

## idxmax():-

In [26]:
# To get the index of the maximum value in a given column
data['Price'].idxmax()

5

## Working with Missing Data:-

In [27]:
data=pd.DataFrame({'A':['a','b','c','d'],'B':[1,2,3,4],'C':[10,20,30,40]},index=[1,2,3,4],columns=['A','B','C'])
data

   A  B   C
1  a  1  10
2  b  2  20
3  c  3  30
4  d  4  40

In [28]:
data1=data.reindex([1,2,3,4,5,6])

In [29]:
data1

     A    B     C
1    a  1.0  10.0
2    b  2.0  20.0
3    c  3.0  30.0
4    d  4.0  40.0
5  NaN  NaN   NaN
6  NaN  NaN   NaN

In [30]:
# To know that the dataframe has missing(NaN) data or not
pd.isna(data1)

       A      B      C
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5   True   True   True
6   True   True   True

## shape attribute:-

In [31]:
# To know the shape of the dataframe
data.shape

(4, 3)

# Working with CSV Files:

In [32]:
df=pd.DataFrame({'Name':['A','B','C','D','E'],
                'Age':[18,19,20,18,21],
                'Gender':['M','F','F','M','M']})
# To write the data into csv format
df.to_csv('FirstCSVFile.csv', index=False)

In [33]:
# To read the csv file
data=pd.read_csv('FirstCSVFile.csv')

In [34]:
data

  Name  Age Gender
0    A   18      M
1    B   19      F
2    C   20      F
3    D   18      M
4    E   21      M

In [36]:
# To get the unique values in a column
data['Name'].unique()

array(['A', 'B', 'C', 'D', 'E'], dtype=object)

In [37]:
data['Gender'].unique()

array(['M', 'F'], dtype=object)

In [41]:
# To count the frequency of each value in a column using value_counts() method
count=data['Gender'].value_counts()
print(count)

M    3
F    2
Name: Gender, dtype: int64

## concat():-

In [49]:
# concate() function is used to join homogeneously-typed objects such as tables together
a1=pd.DataFrame({'A':[1,2,3,4,5],
               'B':['one','two','three','four','five']})
a2=pd.DataFrame({'A':[6,7,8,9,10],
               'B':['six','seven','eight','nine','ten']})
lst=[a1,a2]
a=pd.concat(lst, keys=['a1','a2']) # here the 'keys' will help to differentiate or categorize the data of different tables
a

       A      B
a1 0   1    one
   1   2    two
   2   3  three
   3   4   four
   4   5   five
a2 0   6    six
   1   7  seven
   2   8  eight
   3   9   nine
   4  10    ten

## merge():-

In [51]:
# merge() function is used to merge the dataframes on the basis of their common column
a1=pd.DataFrame({'A':[1,2,3,4,5],
               'B':['one','two','three','four','five']})
a2=pd.DataFrame({'A':[1,2,3,4,5],
               'C':['six','seven','eight','nine','ten']})
a=pd.merge(a1,a2) # here the common column is 'A'
a

   A      B      C
0  1    one    six
1  2    two  seven
2  3  three  eight
3  4   four   nine
4  5   five    ten